app/Http/Controllers/Backend/BaseController.php

select count(*) as aggregate from `contacts` where `is_read` = 0
---
    function getUnreadContactCount(): mixed
    {
        return Cache::remember(Contact::$backendCacheKey, rand(0, 60), function () {
            return Contact::where('is_read', CommonStatus::Inactive)->count();